export type Film = 
  {
    title: string,
      titleForDomain?: string,
      timeArr: string[],
      img: string,
      releasedOn: string,
      countryFrom: string,
      createdBy: string,
      genre: string[],
      actors: string[],
      description: string,
      id?: number
  
} | undefined
type FilmsData = Film[]

const filmsData : FilmsData = [
  {
    title: 'Щедрик',
    titleForDomain: 'shedryk',
    timeArr: ['11:45'],
    img: '/images/HomeSchedule/Shedryk.png',
    releasedOn: '15.02.2023',
    countryFrom: 'США',
    createdBy: 'ДЖеймс Кемерон',
    genre: ['фантастика', 'бойовик', 'пригоди', 'фентезі'],
    actors: ['Сем Вортінґтон', 'Зої Салдана', 'Кейт Вінслет', 'Мішель Єо', 'Сіґурні Вівер', 'Джованні Рібізі'],
    description: 'Історія розгортається більше ніж через десятиліття після подій першого фільму. Стрічка розповідає про сім’ю Саллі (Джейка, Нейтірі та їхніх дітей), проблеми, які їх переслідують, шлях, який вони долають, щоб захистити одне одного від небезпек, битви, які вони ведуть, щоб залишитися живими, і трагедії, які вони переживають разом.',
    id: 1
  },
  {
    title: 'Пригоди Тедді',
    titleForDomain: 'prigody-teddi',
    timeArr: ['10:00', '11:45', '15:05'],
    img: '/images/HomeSchedule/Teddi.png',
    releasedOn: '15.02.2023',
    countryFrom: 'США',
    createdBy: 'ДЖеймс Кемерон',
    genre: ['фантастика', 'бойовик', 'пригоди', 'фентезі'],
    actors: ['Сем Вортінґтон', 'Зої Салдана', 'Кейт Вінслет', 'Мішель Єо', 'Сіґурні Вівер', 'Джованні Рібізі'],
    description: 'Історія розгортається більше ніж через десятиліття після подій першого фільму. Стрічка розповідає про сім’ю Саллі (Джейка, Нейтірі та їхніх дітей), проблеми, які їх переслідують, шлях, який вони долають, щоб захистити одне одного від небезпек, битви, які вони ведуть, щоб залишитися живими, і трагедії, які вони переживають разом.',
    id: 2
  },
  {
    title: 'Кіт в чоботях',
    titleForDomain: 'kit-v-chovotyah',
    timeArr: ['11:45', '17:45', '20:45'],
    img: '/images/HomeSchedule/Kit.png',
    releasedOn: '15.02.2023',
    countryFrom: 'США',
    createdBy: 'ДЖеймс Кемерон',
    genre: ['фантастика', 'бойовик', 'пригоди', 'фентезі'],
    actors: ['Сем Вортінґтон', 'Зої Салдана', 'Кейт Вінслет', 'Мішель Єо', 'Сіґурні Вівер', 'Джованні Рібізі'],
    description: 'Історія розгортається більше ніж через десятиліття після подій першого фільму. Стрічка розповідає про сім’ю Саллі (Джейка, Нейтірі та їхніх дітей), проблеми, які їх переслідують, шлях, який вони долають, щоб захистити одне одного від небезпек, битви, які вони ведуть, щоб залишитися живими, і трагедії, які вони переживають разом.',
    id: 3
  },
  {
    title: 'Різдвяні канікули',
    titleForDomain: 'rizdviyani-kanikuly',
    timeArr: ['14:45', '17:30'],
    img: '/images/HomeSchedule/Kanikuly.png',
    releasedOn: '15.02.2023',
    countryFrom: 'США',
    createdBy: 'ДЖеймс Кемерон',
    genre: ['фантастика', 'бойовик', 'пригоди', 'фентезі'],
    actors: ['Сем Вортінґтон', 'Зої Салдана', 'Кейт Вінслет', 'Мішель Єо', 'Сіґурні Вівер', 'Джованні Рібізі'],
    description: 'Історія розгортається більше ніж через десятиліття після подій першого фільму. Стрічка розповідає про сім’ю Саллі (Джейка, Нейтірі та їхніх дітей), проблеми, які їх переслідують, шлях, який вони долають, щоб захистити одне одного від небезпек, битви, які вони ведуть, щоб залишитися живими, і трагедії, які вони переживають разом.',
    id: 4
  },
  {
    title: 'Операція ”Фортуна”',
    titleForDomain: 'operaciya-fortuna',
    timeArr: ['11:50', '19:30'],
    img: '/images/HomeSchedule/Fortuna.png',
    releasedOn: '15.02.2023',
    countryFrom: 'США',
    createdBy: 'ДЖеймс Кемерон',
    genre: ['фантастика', 'бойовик', 'пригоди', 'фентезі'],
    actors: ['Сем Вортінґтон', 'Зої Салдана', 'Кейт Вінслет', 'Мішель Єо', 'Сіґурні Вівер', 'Джованні Рібізі'],
    description: 'Історія розгортається більше ніж через десятиліття після подій першого фільму. Стрічка розповідає про сім’ю Саллі (Джейка, Нейтірі та їхніх дітей), проблеми, які їх переслідують, шлях, який вони долають, щоб захистити одне одного від небезпек, битви, які вони ведуть, щоб залишитися живими, і трагедії, які вони переживають разом.',
    id: 5
  },
  {
    title: 'Аватар 2: Шлях води',
    titleForDomain: 'avatar-2',
    timeArr: ['10:00', '17:45', '20:35'],
    img: '/images/HomeSchedule/Avatar.png',
    releasedOn: '15.02.2023',
    countryFrom: 'США',
    createdBy: 'ДЖеймс Кемерон',
    genre: ['фантастика', 'бойовик', 'пригоди', 'фентезі'],
    actors: ['Сем Вортінґтон', 'Зої Салдана', 'Кейт Вінслет', 'Мішель Єо', 'Сіґурні Вівер', 'Джованні Рібізі'],
    description: 'Історія розгортається більше ніж через десятиліття після подій першого фільму. Стрічка розповідає про сім’ю Саллі (Джейка, Нейтірі та їхніх дітей), проблеми, які їх переслідують, шлях, який вони долають, щоб захистити одне одного від небезпек, битви, які вони ведуть, щоб залишитися живими, і трагедії, які вони переживають разом.',
    id: 6
  },
  {
    title: 'Вавилон',
    titleForDomain: 'vavylon',
    timeArr: ['18:45', '21:30'],
    img: '/images/HomeSchedule/Vavylon.png',
    releasedOn: '15.02.2023',
    countryFrom: 'США',
    createdBy: 'ДЖеймс Кемерон',
    genre: ['фантастика', 'бойовик', 'пригоди', 'фентезі'],
    actors: ['Сем Вортінґтон', 'Зої Салдана', 'Кейт Вінслет', 'Мішель Єо', 'Сіґурні Вівер', 'Джованні Рібізі'],
    description: 'Історія розгортається більше ніж через десятиліття після подій першого фільму. Стрічка розповідає про сім’ю Саллі (Джейка, Нейтірі та їхніх дітей), проблеми, які їх переслідують, шлях, який вони долають, щоб захистити одне одного від небезпек, битви, які вони ведуть, щоб залишитися живими, і трагедії, які вони переживають разом.',
    id: 7
  },
  {
    title: 'Чоловік на ім’я Отто',
    titleForDomain: 'cholovik-na-imya-otto',
    releasedOn: '15.02.2023',
    countryFrom: 'США',
    createdBy: 'ДЖеймс Кемерон',
    genre: ['фантастика', 'бойовик', 'пригоди', 'фентезі'],
    actors: ['Сем Вортінґтон', 'Зої Салдана', 'Кейт Вінслет', 'Мішель Єо', 'Сіґурні Вівер', 'Джованні Рібізі'],
    description: 'Історія розгортається більше ніж через десятиліття після подій першого фільму. Стрічка розповідає про сім’ю Саллі (Джейка, Нейтірі та їхніх дітей), проблеми, які їх переслідують, шлях, який вони долають, щоб захистити одне одного від небезпек, битви, які вони ведуть, щоб залишитися живими, і трагедії, які вони переживають разом.',
    timeArr: ['21:40'],
    img: '/images/HomeSchedule/Otto.png',
    id: 8
  }
]
export default filmsData;