const whyUsData = [
  {
    icon: "/images/WhyUsIcons/Vector-1.svg",
    title: "2D та 3D зали",
    id: 1,
    text: `Сеанс із залученням технологій об'ємного зображення для шанувальників видовищних спецефектів, а також зали для любителей звичайного кіно.`,
  },
  {
    icon: "/images/WhyUsIcons/vector-2.svg",
    title: "Вимоги DCI",
    id: 2,
    text: `"CINEPLEX" - першокласний кінотеатр, який відповідає світовому рівню техніки, дизайну та сервісу. В ньому встановлено цифрове обладнання, що відповідає вимогам DCI. `,
  },
  {
    icon: "/images/WhyUsIcons/vector-3.svg",
    title: "Ігротека",
    id: 3,
    text: `В кінотеатрі є справжній парк розваг, що включає в себе як атракціони різних вікових категорій, так і віртуальні комп'ютерні ігри, з інтерактивною участю дітей і дорослих.`,
  },
  {
    icon: "/images/WhyUsIcons/vector-4.svg",
    title: "Burger City",
    id: 4,
    text: `Власне кафе та великий асортимент снеків, якими можна пригоститись в залі або за столиком. Сирний попкорн - це саме те, чого тобі не вистачало для перегляду классної новинки!`,
  },
  {
    icon: "/images/WhyUsIcons/vector-5.svg",
    title: "Бронювання",
    id: 5,
    text: `Забронювати квитки можна на сайті або по номеру телефона. Бронь знімається за пів години до сеансу.
    Також  можно придбати квитки онлайн.`,
  },
  {
    icon: "/images/WhyUsIcons/vector-6.svg",
    title: "Комфорт",
    id: 6,
    text: `Сеанс на кріслах що забезпечують підвищений комфорт перегляду для гурманів кіно.`,
  },
];
export default whyUsData;
